In [1]:
import pandas as pd

In [2]:
dates_df = pd.read_csv('dates.csv')
dates_df.sample(n=5)

                      date
73305  2004-11-10 20:45:49
16798  2015-11-15 04:59:49
46778  2007-08-03 17:33:39
21654  2005-06-02 16:19:39
2406   2000-08-08 03:12:11

In [3]:
movies_df = pd.read_csv('movies.csv')
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rate1_df = pd.read_csv('ratings1.csv')
rate1_df.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [5]:
rate2_df = pd.read_csv('ratings2.csv')
rate2_df.head()

   userId  movieId  rating
0     274     5621     2.0
1     274     5630     3.0
2     274     5667     3.5
3     274     5679     3.5
4     274     5690     3.0

In [6]:
movies_df['movieId'].nunique()

9742

In [7]:
rate1_df['userId'].nunique()

274

In [8]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    100836 non-null  object
dtypes: object(1)
memory usage: 787.9+ KB

In [9]:
dates_df['date'] = pd.to_datetime(dates_df['date'])
dates_df['date'].dt.year.mode()[0]

2000

In [10]:
ratings = pd.concat(
    [rate1_df, rate2_df],
    ignore_index=True
)
ratings

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [11]:
ratings.shape[0]

100837

In [12]:
dates_df.shape[0]

100836

In [13]:
rate1_df.tail(1)

       userId  movieId  rating
40000     274     5621     2.0

In [14]:
rate2_df.head(1)

   userId  movieId  rating
0     274     5621     2.0

In [15]:
ratings = ratings.drop_duplicates(ignore_index=True)
ratings.shape[0]

100836

In [16]:
ratings_dates = pd.concat([ratings, dates_df], axis=1)
ratings_dates.sample(n=5)

       userId  movieId  rating                date
99748     610     3703     4.5 2017-05-03 22:24:32
71407     458     1006     4.0 1996-10-18 15:25:11
38795     266     2278     5.0 1999-12-12 06:42:16
22283     150       36     4.0 1997-01-25 14:38:43
94585     599    48043     3.0 2017-06-27 00:52:33

In [18]:
joined = ratings_dates.join(
    movies_df.set_index('movieId'),
    on='movieId',
    how='left'
)
joined.head()

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [22]:
merged = ratings_dates.merge(
    movies_df,
    on='movieId',
    how='left'
)
merged.head()

,userId,movieId,rating,date,title,genres
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [26]:
merge_ratings = rate1_df.merge(rate2_df, how='outer')
merge_ratings

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100836 rows x 3 columns]

In [3]:
items_df = pd.DataFrame({
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394],
    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
})

purchase_df = pd.DataFrame({
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132],
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
})

In [11]:
merged = items_df.merge(purchase_df, how='inner', on='item_id')
merged

   item_id   vendor  stock_count  purchase_id  price
0   417283  Samsung           54          101  13900
1   849734       LG           33          101   5330
2   132223    Apple          122          101  38200
3   573943    Apple           18          112  49990
4    19475       LG          102          121   9890
5  3294095    Apple           43          145  33000
6   382043  Samsung           77          145  67500
7   302948  Samsung          143          145  34500
8   100132       LG           60          221  11400

In [2]:
import re 
def get_year_release(arg):
    #находим все слова по шаблону "(DDDD)"
    candidates = re.findall(r'\(\d{4}\)', arg) 
    # проверяем число вхождений
    if len(candidates) > 0:
        #если число вхождений больше 0,
	#очищаем строку от знаков "(" и ")"
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        #если год не указан, возвращаем None
        return None

In [29]:
ratings_movies = pd.read_csv('ratings_movies.csv')
ratings_movies.sample(n=5)

,Unnamed: 0,userId,movieId,rating,date,title,genres
11977,11977,73,106782,4.5,2016-05-25 17:27:13,"Wolf of Wall Street, The (2013)",Comedy|Crime|Drama
82621,82621,525,107,3.5,2016-10-14 20:54:36,Muppet Treasure Island (1996),Adventure|Children|Comedy|Musical
30421,30421,212,87192,4.0,2017-06-25 22:29:43,Attack the Block (2011),Action|Comedy|Sci-Fi
62264,62264,413,3408,4.0,2017-01-15 00:27:43,Erin Brockovich (2000),Drama
36672,36672,249,4896,4.0,2017-01-30 00:01:03,Harry Potter and the Sorcerer's Stone (a.k.a. ...,Adventure|Children|Fantasy

In [31]:
ratings_movies.drop('Unnamed: 0', axis=1, inplace=True)

In [67]:
ratings_movies['year_release'] = ratings_movies['title'].apply(get_year_release)
ratings_movies['year_release'].isna().sum()

18

In [17]:
mask = ratings_movies['year_release'] == 1999

In [18]:
ratings_movies[mask].groupby('title')['rating'].mean().sort_values()

title
Bloodsport: The Dark Kumite (1999)            0.5
Simon Sez (1999)                              1.0
Chill Factor (1999)                           1.0
Source, The (1999)                            1.0
Trippin' (1999)                               1.0
                                             ...
Trailer Park Boys (1999)                      5.0
Larry David: Curb Your Enthusiasm (1999)      5.0
Sun Alley (Sonnenallee) (1999)                5.0
George Carlin: You Are All Diseased (1999)    5.0
Five Senses, The (1999)                       5.0
Name: rating, Length: 261, dtype: float64

In [22]:
mask = ratings_movies['year_release'] == 2010
ratings_movies[mask].groupby('genres')['rating'].mean().sort_values().index[0]

'Action|Sci-Fi'

In [27]:
ratings_movies.groupby('userId')['genres'].nunique().sort_values(ascending=False).index[0]

599

In [45]:
ratings_movies.groupby('userId')['rating'].agg(['count', 'mean']).sort_values(['count', 'mean'], ascending=[True, False])

        count      mean
userId
53         20  5.000000
595        20  4.200000
189        20  4.100000
569        20  4.000000
278        20  3.875000
...       ...       ...
274      1346  3.235884
448      1864  2.847371
474      2108  3.398956
599      2478  2.642050
414      2698  3.391957

[610 rows x 2 columns]

In [50]:
mask = ratings_movies['year_release'] == 2018

In [60]:
grouped = ratings_movies[mask].groupby('genres')['rating'].agg(['mean', 'count'])
grouped[grouped['count'] > 10].sort_values('mean', ascending=False).index[0]

'Action|Adventure|Sci-Fi'

In [61]:
ratings_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   userId        100836 non-null  int64
 1   movieId       100836 non-null  int64
 2   rating        100836 non-null  float64
 3   date          100836 non-null  object
 4   title         100836 non-null  object
 5   genres        100836 non-null  object
 6   year_release  100818 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 5.4+ MB

In [64]:
ratings_movies['date'] = pd.to_datetime(ratings_movies['date'])
ratings_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   userId        100836 non-null  int64
 1   movieId       100836 non-null  int64
 2   rating        100836 non-null  float64
 3   date          100836 non-null  datetime64[ns]
 4   title         100836 non-null  object
 5   genres        100836 non-null  object
 6   year_release  100818 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 5.4+ MB

In [70]:
ratings_movies['year_rating'] = ratings_movies['date'].dt.year
ratings_movies.head()

,userId,movieId,rating,date,title,genres,year_release,year_rating
0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995.0,2000
1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance,1995.0,2000
2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller,1995.0,2000
3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995.0,2000
4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995.0,2000

In [82]:
ratings_movies.pivot_table(
    values='rating',
    index='genres',
    columns='year_rating')[2018].loc['Animation|Children|Mystery']

5.0